{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "main_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 84, 84, 3], "dtype": "float32", "sparse": false, "name": "main_input"}, "inbound_nodes": []}, {"name": "conv1", "class_name": "Conv2D", "config": {"name": "conv1", "trainable": true, "filters": 32, "kernel_size": [8, 8], "strides": [4, 4], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["main_input", 0, 0, {}]]]}, {"name": "conv2", "class_name": "Conv2D", "config": {"name": "conv2", "trainable": true, "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv1", 0, 0, {}]]]}, {"name": "conv3", "class_name": "Conv2D", "config": {"name": "conv3", "trainable": true, "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv2", 0, 0, {}]]]}, {"name": "conv4", "class_name": "Conv2D", "config": {"name": "conv4", "trainable": true, "filters": 512, "kernel_size": [7, 7], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["conv3", 0, 0, {}]]]}, {"name": "value", "class_name": "Lambda", "config": {"name": "value", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAmQBZACFAmYEGQBT\nACkCTukAAQAAqQApAdoFbGF5ZXJyAgAAAHICAAAA+h88aXB5dGhvbi1pbnB1dC0zNC1hODE1ZGJm\nODVlN2M+2gg8bGFtYmRhPi4AAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "advantage", "class_name": "Lambda", "config": {"name": "advantage", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcyAAAAB8AGQAZACFAmQAZACFAmQAZACFAmQAZAGFAmYEGQBT\nACkCTukAAQAAqQApAdoFbGF5ZXJyAgAAAHICAAAA+h88aXB5dGhvbi1pbnB1dC0zNC1hODE1ZGJm\nODVlN2M+2gg8bGFtYmRhPi0AAABzAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["conv4", 0, 0, {}]]]}, {"name": "value_flatten", "class_name": "Flatten", "config": {"name": "value_flatten", "trainable": true}, "inbound_nodes": [[["value", 0, 0, {}]]]}, {"name": "advantage_flatten", "class_name": "Flatten", "config": {"name": "advantage_flatten", "trainable": true}, "inbound_nodes": [[["advantage", 0, 0, {}]]]}, {"name": "value_final", "class_name": "Dense", "config": {"name": "value_final", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["value_flatten", 0, 0, {}]]]}, {"name": "advantage_final", "class_name": "Dense", "config": {"name": "advantage_final", "trainable": true, "units": 4, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["advantage_flatten", 0, 0, {}]]]}, {"name": "final_out", "class_name": "Lambda", "config": {"name": "final_out", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAcAAABTAAAAcyQAAAB8AGQBGQB8AGQCGQB0AGoBfABkAhkAZAJkA2QEjQMY\nABcAUwApBU7pAAAAAOkBAAAAVCkC2gRheGlz2ghrZWVwZGltcykC2gFL2gRtZWFuKQFaB3ZhbF9h\nZHapAHIHAAAA+h88aXB5dGhvbi1pbnB1dC0zNC1hODE1ZGJmODVlN2M+2gg8bGFtYmRhPjwAAABz\nAAAAAA==\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["value_final", 0, 0, {}], ["advantage_final", 0, 0, {}]]]}], "input_layers": [["main_input", 0, 0]], "output_layers": [["final_out", 0, 0]]}, "keras_version": "2.1.2", "backend": "tensorflow"}